---
kind: property
id: P:Autodesk.Revit.DB.Visual.Asset.Title
source: html/bf0cfeff-1eba-4734-d2aa-96f23b7009a1.htm
---
# Autodesk.Revit.DB.Visual.Asset.Title Property

Asset title

## Syntax (C#)
```csharp
public string Title { get; }
```